# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSet..::..Contains Method
WireSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	Wire item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As Wire _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	Wire^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..Wire
# See Also
WireSet Class
Autodesk.Revit.DB.Electrical Namespace